--1. Получите список всех существующих PDB в рамках экземпляра ORA12W.
-- Определите их текущее состояние.
SELECT name, open_mode FROM v$pdbs;
SELECT PDB_NAME FROM dba_pdbs WHERE status != 'STUB' and PDB_NAME!='PDB$SEED' ORDER BY PDB_NAME;
--2. Создайте собственный экземпляр PDB
-- (необходимо подключиться к серверу с серверного компьютера и используйте Database Configuration Assistant)
-- с именем XXX_PDB, где XXX – инициалы студента.
SELECT * FROM v$session WHERE username is not null;

--3. Получите список всех существующих PDB в рамках экземпляра ORA12W. Убедитесь, что созданная PDB-база данных существует.
SELECT name, open_mode FROM v$pdbs;
SELECT PDB_NAME FROM dba_pdbs WHERE status != 'STUB' and PDB_NAME!='PDB$SEED' ORDER BY PDB_NAME;
--4. Подключитесь к XXX_PDB c помощью SQL Developer создайте инфраструктурные объекты (табличные пространства, роль, профиль безопасности, пользователя с именем U1_XXX_PDB).
--5. Подключитесь к пользователю U1_XXX_PDB, с помощью SQL Developer, создайте таблицу XXX_table, добавьте в нее строки, выполните SELECT-запрос к таблице.
--6. С помощью представлений словаря базы данных определите, все табличные пространства, все  файлы (перманентные и временные), все роли (и выданные им привилегии), профили безопасности, всех пользователей  базы данных XXX_PDB и  назначенные им роли.
--7. Подключитесь к CDB-базе данных, создайте общего пользователя с именем C##XXX, назначьте ему привилегию, позволяющую подключится к базе данных XXX_PDB.
--8. Выдайте пользователю C##XXX привилегию на создание таблицы
--9. Создайте 2 подключения пользователя C##XXX в SQL Developer к CDB-базе данных и  XXX_PDB – базе данных. Проверьте их работоспособность.
--10. Подключитесь пользователем C##XXX, создайте таблицу и добавьте в нее данные.
--11. Просмотрите все объекты, доступные пользователям C##XXX и U1_XXX_PD.
--12. Назначьте привилегию, разрешающему подключение к XXX_PDB общему пользователю C##YYY, созданному другим студентом. Убедитесь в работоспособности  этого пользователя в базе данных XXX_PDB.
--13. Подключитесь к пользователю U1_XXX_PDB со своего компьютера, а к пользователям C##XXX и C##YYY с другого (к XXX_PDB-базе данных). На своем компьютере получите список всех текущих подключений к XXX_PDB (найдите в списке созданные вами подключения). На своем компьютере получите список всех текущих подключений к СDB (найдите в списке созданные вами подключений).
--14. Продемонстрируйте преподавателю, работоспособную PDB-базу данных и созданную инфраструктуру (результаты всех запросов). Покажите файлы PDB-базы данных (на серверном компьютере).
--15. Удалите созданную базу данных XXX_PDB. Убедитесь, что все файлы PDB-базы данных удалены. Удалите пользователя C##XXX. Удалите в SQL Developer все подключения к XXX_PDB.


grant create session to C##NNDP;
ALTER USER C##NNDP QUOTA 2M ON USERS;
grant create table to C##NNDP;
SELECT owner, object_name, object_type
FROM all_objects
WHERE owner IN ('C##NNDP', 'U1_NNDP_PDB')
ORDER BY owner, object_type, object_name;

create user c##nndp1 identified by pass;

grant create session to c##nndp1;

select *from v$session;
